УТ/src/InformationRegisters/CRM_НастройкиРасположенияЭлементовНаФормах/CRM_НастройкиРасположенияЭлементовНаФормах.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>CRM_НастройкиРасположенияЭлементовНаФормах</name>
  <resources>
    <name>ЗаголовокЭлемента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ИмяЭлементаРазмещения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПорядокРасположения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ИмяФормы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ИмяЭлемента</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УТ/src/Catalogs/Партнеры/Партнеры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Партнеры</name>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <predefined>
    <items>
      <name>НашеПредприятие</name>
      <description>Наше предприятие</description>
    </items>
    <items>
      <name>НеизвестныйПартнер</name>
      <description>Неизвестный партнер</description>
    </items>
    <items>
      <name>РозничныйПокупатель</name>
      <description>Розничный покупатель</description>
    </items>
  </predefined>
  <attributes>
    <name>БизнесРегион</name>
    <comment>Используется для группировки по территориальному признаку</comment>
    <type>
      <types>CatalogRef.БизнесРегионы</types>
    </type>
  </attributes>
  <attributes>
    <name>ГруппаДоступа</name>
    <type>
      <types>CatalogRef.ГруппыДоступаПартнеров</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРегистрации</name>
    <comment>Используется при анализе первичного интереса</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Клиент</name>
    <comment>Клиенты</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Поставщик</name>
    <comment>Поставщики</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеПолное</name>
    <comment>Публичное наименование, например, для печати или устного обращения.</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнойМенеджер</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Конкурент</name>
    <comment>Конкуренты</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПрочиеОтношения</name>
    <comment>Прочие отношения</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбслуживаетсяТорговымиПредставителями</name>
    <comment>Обслуживаются торговыми представителями</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДополнительнаяИнформация</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Перевозчик</name>
    <comment>Перевозчики</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ШаблонЭтикетки</name>
    <type>
      <types>CatalogRef.ШаблоныЭтикетокИЦенников</types>
    </type>
  </attributes>
  <attributes>
    <name>ЮрФизЛицо</name>
    <type>
      <types>EnumRef.КомпанияЧастноеЛицо</types>
    </type>
  </attributes>
  <attributes>
    <name>Пол</name>
    <type>
      <types>EnumRef.ПолФизическогоЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРождения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НазначениеПереработчика</name>
    <type>
      <types>CatalogRef.Назначения</types>
    </type>
  </attributes>
  <attributes>
    <name>ВариантОтправкиЭлектронногоЧека</name>
    <type>
      <types>EnumRef.ВариантыОтправкиЭлектронногоЧекаПокупателю</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗонаДоставки</name>
    <type>
      <types>CatalogRef.ЗоныДоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидЦен</name>
    <type>
      <types>CatalogRef.ВидыЦен</types>
    </type>
  </attributes>
  <attributes>
    <name>ИндивидуальныйВидЦены</name>
    <comment>Уточняющий или индивидуальный вид цены</comment>
    <type>
      <types>CatalogRef.ВидыЦен</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_Автор</name>
    <type>
      <types>CatalogRef.ВнешниеПользователи</types>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_Важность</name>
    <comment>Важность клиента</comment>
    <type>
      <types>CatalogRef.CRM_ВажностьКлиентов</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_Имя</name>
    <comment>Имя клиента</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>CRM_НапоминатьОДнеРождения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_ОсновнаяОтрасль</name>
    <type>
      <types>CatalogRef.CRM_Отрасли</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_ОсновноеКонтактноеЛицо</name>
    <type>
      <types>CatalogRef.КонтактныеЛицаПартнеров</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_ОсновнойАдрес</name>
    <type>
      <types>CatalogRef.CRM_АдресаОфисовКомпании</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_ОтписалсяОтEmailРассылок</name>
    <comment>Отписался от рассылок</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_Отчество</name>
    <comment>Отчество клиента частное лицо</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>CRM_Потенциал</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>CRM_СегментРынка</name>
    <comment>Сегмент рынка клиента</comment>
    <type>
      <types>CatalogRef.CRM_СегментыРынка</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_СтатусРаботы</name>
    <comment>Статус работы с клиентом</comment>
    <type>
      <types>CatalogRef.CRM_СтатусыРаботыСКлиентом</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_ТипОтношенийПредставление</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>CRM_Фамилия</name>
    <comment>Фамилия клиента частное лицо</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>CRM_ФизЛицо</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_Фотография</name>
    <comment>Фотография клиента частное лицо</comment>
    <type>
      <types>CatalogRef.ПартнерыПрисоединенныеФайлы</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_ЧисленностьРабочихМест</name>
    <comment>Численность рабочих мест клиента</comment>
    <type>
      <types>CatalogRef.CRM_ЧисленностьРабочихМестКлиента</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_ЧисленностьСотрудников</name>
    <comment>Численность сотрудников клиента</comment>
    <type>
      <types>CatalogRef.CRM_ЧисленностьСотрудниковКлиента</types>
    </type>
  </attributes>
  <attributes>
    <name>сфпCoMagicID</name>
    <comment>Идентификатор контакта в системе CoMagic</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>сфпПользовательДляПереключенияЗвонков</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьCRM_Госорганы</name>
    <comment>Клиент является государственной организацией</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьCRM_Учредитель</name>
    <comment>Клиент является учредителем</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Регион</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидДляСписка</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>CRM_ОсновнойДляСвязи</name>
      <comment>Основной вид контактной информации для связи</comment>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>сфпВремяЗадержкиНабораДобавочногоНомера</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>сфпПрефиксНабора</name>
      <type>
        <types>CatalogRef.сфпПрефиксыИсходящихВызовов</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>CRM_ВидыДеятельности</name>
    <attributes>
      <name>ВидДеятельности</name>
      <type>
        <types>CatalogRef.CRM_Отрасли</types>
      </type>
    </attributes>
    <attributes>
      <name>Ответственный</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>КонтактноеЛицо</name>
      <type>
        <types>CatalogRef.КонтактныеЛицаПартнеров</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>CRM_ДополнительнаяИнформация</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.CRM_ДополнительнаяИнформация</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.CRM_ДополнительнаяИнформация</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаРегистрации</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>CRM_Теги</name>
    <attributes>
      <name>Тег</name>
      <type>
        <types>CatalogRef.CRM_Теги</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>CRM_ТипыОтношений</name>
    <attributes>
      <name>ТипОтношений</name>
      <type>
        <types>CatalogRef.CRM_ТипыОтношений</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

УТ/src/CommonModules/CRM_УправлениеЭлементамиНаФормах/Module.bsl
#Область ПрограммныйИнтерфейс

////////////////////////////////////////////////////////////////////////////////
// Процедуры и функции для стандартной обработки дополнительных реквизитов.

// Создает основные реквизиты и поля формы, необходимые для работы.
// Заполняет дополнительные реквизиты, если используются.
// Вызывается из обработчика ПриСозданииНаСервере формы объекта со свойствами.
// 
// Параметры:
//  Форма							- ФормаКлиентскогоПриложения - в которой будут отображаться дополнительные реквизиты.
//  ИмяЭлементаРазмещенияКоманды	- Строка - имя элемента размещения команды.
//  ДопИмяЭлементаРазмещенияКоманды - Строка - дополнительное имя элемента размещения команды.
//  ПостфиксФормы					- Строка - постфикс формы.
//
Процедура ПриСозданииНаСервере(Форма, ИмяЭлементаРазмещенияКоманды = "",
	 ДопИмяЭлементаРазмещенияКоманды = "",
	 ПостфиксФормы = "") Экспорт
	
	Если Форма.Параметры.Свойство("РасположениеЭлементовПоУмолчанию") Тогда
		Возврат;
	КонецЕсли;
	ОписаниеФормы = Неопределено;
	Если ОписаниеНастраиваемыхФорм().Свойство(СтрЗаменить(Форма.ИмяФормы, ".", "_"), ОписаниеФормы) Тогда
		
		РазместитьЭлементыПоНастройке(Форма, ОписаниеФормы, ПостфиксФормы);
		
		ДоступноРедактированиеРасположенияЭлементовФормы = РольДоступна("ПолныеПрава")
			 ИЛИ РольДоступна("CRM_НастройкаПрограммы");
		Если ДоступноРедактированиеРасположенияЭлементовФормы Тогда
			
			Если ЗначениеЗаполнено(ИмяЭлементаРазмещенияКоманды) Тогда
				ЭлементРазмещенияКоманды = Форма.Элементы.Найти(ИмяЭлементаРазмещенияКоманды);
				Если ЭлементРазмещенияКоманды = Неопределено Тогда
					Возврат;
				КонецЕсли;	
			Иначе 
				ЭлементРазмещенияКоманды = Форма.Элементы.Найти("КоманднаяПанельФормы");
				Если ЭлементРазмещенияКоманды = Неопределено Тогда
					Возврат;
				КонецЕсли;	
			КонецЕсли;
			
			Если Форма.Команды.Найти("НастроитьРасположениеЭлементовФормы") = Неопределено Тогда
				Команда = Форма.Команды.Добавить("НастроитьРасположениеЭлементовФормы");
				Команда.Действие = "Подключаемый_НастройкаРасположенияЭлементовФормы";
				
				КнопкаНастройки = Форма.Элементы.Добавить("НастроитьРасположениеЭлементовФормы",
					 Тип("КнопкаФормы"),
					 ЭлементРазмещенияКоманды);
				КнопкаНастройки.Заголовок = НСтр("ru='Настроить состав и расположение полей';
					|en='Set Up Composition and Field Location'");
				КнопкаНастройки.Картинка = БиблиотекаКартинок.CRM_НастройкиРабочийСтол;
				КнопкаНастройки.ИмяКоманды = "НастроитьРасположениеЭлементовФормы";
				КнопкаНастройки.ТолькоВоВсехДействиях = Истина;
				
				Если ЗначениеЗаполнено(ДопИмяЭлементаРазмещенияКоманды) Тогда
					ЭлементРазмещенияКоманды = Форма.Элементы.Найти(ДопИмяЭлементаРазмещенияКоманды);
					Если ЭлементРазмещенияКоманды <> Неопределено Тогда
						КнопкаНастройки = Форма.Элементы.Добавить("ДопНастроитьРасположениеЭлементовФормы",
							 Тип("КнопкаФормы"),
							 ЭлементРазмещенияКоманды);
						КнопкаНастройки.Заголовок = НСтр("ru='Настроить поля';en='Configure Fields'");
						КнопкаНастройки.ИмяКоманды = "НастроитьРасположениеЭлементовФормы";
						КнопкаНастройки.ЦветТекста = ЦветаСтиля.CRM_ОсновнойГолубой;
						КнопкаНастройки.ОтображениеФигуры = ОтображениеФигурыКнопки.Нет;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
				
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Возвращает описание настраиваемых форм.
//
// Параметры:
//	ЭтоПоддержка - Булево - признак поддержки.
//
// Возвращаемое значение:
//	Структура - описания форм.
Функция ОписаниеНастраиваемыхФорм(ЭтоПоддержка = Ложь) Экспорт
	
	ОписанияФорм = Новый Структура;	
	
	// Новая форма интереса
	#Область НоваяФормаИнтереса
	
	ОписаниеФормы = Новый Структура;
	
	МассивОбластей = Новый Массив;
	МассивОбластей.Добавить("ГруппаОсновное");
	МассивОбластей.Добавить("ГруппаДополнительно");
	ОписаниеФормы.Вставить("МассивОбластей", МассивОбластей);
	
	МассивИсключаемыхЭлементов = Новый Массив;
	МассивИсключаемыхЭлементов.Добавить("Ссылка");
	МассивИсключаемыхЭлементов.Добавить("ДекорацияАвторДата");
	МассивИсключаемыхЭлементов.Добавить("ГруппаДополнительныеРеквизиты");
	МассивИсключаемыхЭлементов.Добавить("Декорация10");
	МассивИсключаемыхЭлементов.Добавить("Декорация13");
	
	Если НЕ ПолучитьФункциональнуюОпцию("ФиксироватьПервичныйИнтерес") Тогда
		МассивИсключаемыхЭлементов.Добавить("ГруппаОбщиеСведенияИсточникСостояние");
	КонецЕсли;
	
	Если НЕ ПолучитьФункциональнуюОпцию("CRM_ИспользоватьТипыУслуг") Тогда
		МассивИсключаемыхЭлементов.Добавить("ТипУслуги");
	КонецЕсли;
	
	МассивИсключаемыхЭлементов.Добавить("ГруппаОбращение");
	Если ЭтоПоддержка Тогда
		МассивИсключаемыхЭлементов.Добавить("ГруппаВыручка");
	КонецЕсли;
	
	Если НЕ CRM_ОбщегоНазначенияПовтИсп.ЭтоCRM() Тогда
		ИмяФО = "ИспользоватьСделкиСКлиентами";
		Если НЕ ПолучитьФункциональнуюОпцию(ИмяФО) Тогда
			МассивИсключаемыхЭлементов.Добавить("СделкаСКлиентом");
		КонецЕсли;
	КонецЕсли;
	
	ОписаниеФормы.Вставить("МассивИсключаемыхЭлементов", МассивИсключаемыхЭлементов);
	
	СписокНаборовДопРеквизитов = Новый СписокЗначений;
	Выборка = Справочники.НаборыДополнительныхРеквизитовИСведений.Выбрать(
			УправлениеСвойствами.НаборСвойствПоИмени("Документ_CRM_Интерес"));
	Пока Выборка.Следующий() Цикл
		СписокНаборовДопРеквизитов.Добавить(Выборка.Ссылка);
	КонецЦикла;
	ОписаниеФормы.Вставить("СписокНаборовДопРеквизитов", СписокНаборовДопРеквизитов);
	ОписаниеФормы.Вставить("ИмяЭлементаПередКоторымВставлять", "ГруппаСвязанныеСписки");
	
	ОписанияФорм.Вставить(СтрЗаменить("Документ.CRM_Интерес.Форма.ФормаДокументаНовая", ".", "_"), ОписаниеФормы);	
	
	#КонецОбласти
	
	#Область ПартнерыФормаЭлементаНовая
	
	Если CRM_ОбщегоНазначенияПовтИсп.ЭтоCRM() Тогда
		
		ОписаниеФормы = Новый Структура;
		
		МассивОбластей = Новый Массив;
		МассивОбластей.Добавить("ГруппаСведения");
		МассивОбластей.Добавить("ГруппаДополнительно");
		ОписаниеФормы.Вставить("МассивОбластей", МассивОбластей);
		
		МассивИсключаемыхЭлементов = Новый Массив;
		МассивИсключаемыхЭлементов.Добавить("Ссылка");
		МассивИсключаемыхЭлементов.Добавить("ДекорацияАвторДата");
		МассивИсключаемыхЭлементов.Добавить("ГруппаДополнительныеРеквизиты");
		МассивИсключаемыхЭлементов.Добавить("Декорация10");
		МассивИсключаемыхЭлементов.Добавить("Декорация13");
		
		Если НЕ ПолучитьФункциональнуюОпцию("ФиксироватьПервичныйИнтерес") Тогда
			МассивИсключаемыхЭлементов.Добавить("ГруппаПервичныйИнтерес");
		КонецЕсли;
		
		ОписаниеФормы.Вставить("МассивИсключаемыхЭлементов", МассивИсключаемыхЭлементов);
		
		СписокНаборовДопРеквизитов = Новый СписокЗначений;
		СписокНаборовДопРеквизитов.Добавить(УправлениеСвойствами.НаборСвойствПоИмени("Справочник_Партнеры_Общие"));
		СписокНаборовДопРеквизитов.Добавить(УправлениеСвойствами.НаборСвойствПоИмени("Справочник_Партнеры_Компании_CRM"));
		СписокНаборовДопРеквизитов.Добавить(УправлениеСвойствами.НаборСвойствПоИмени("Справочник_Партнеры_ЧастныеЛица_CRM"));
		ОписаниеФормы.Вставить("СписокНаборовДопРеквизитов", СписокНаборовДопРеквизитов);
		ОписаниеФормы.Вставить("ИмяЭлементаПередКоторымВставлять", "ГруппаСвязанныеСписки");
		
		ОписанияФорм.Вставить(СтрЗаменить("Справочник.Партнеры.Форма.CRM_ФормаЭлементаНовая", ".", "_"), ОписаниеФормы);
		
	Иначе
		
		ОписаниеФормы = Новый Структура;
		
		МассивОбластей = Новый Массив;
		МассивОбластей.Добавить("ГруппаСведения");
		МассивОбластей.Добавить("ГруппаДополнительно");
		ОписаниеФормы.Вставить("МассивОбластей", МассивОбластей);
		
		МассивИсключаемыхЭлементов = Новый Массив;
		МассивИсключаемыхЭлементов.Добавить("Ссылка");
		МассивИсключаемыхЭлементов.Добавить("ДекорацияАвторДата");
		МассивИсключаемыхЭлементов.Добавить("ГруппаДополнительныеРеквизиты");
		МассивИсключаемыхЭлементов.Добавить("ГруппаОтношения");
		МассивИсключаемыхЭлементов.Добавить("ГруппаОтношенияДополнительно");
		МассивИсключаемыхЭлементов.Добавить("Декорация10");
		МассивИсключаемыхЭлементов.Добавить("Декорация13");
		
		
		Если НЕ ПолучитьФункциональнуюОпцию("ФиксироватьПервичныйИнтерес") Тогда
			МассивИсключаемыхЭлементов.Добавить("ГруппаПервичныйИнтерес");
		КонецЕсли;
		
		ИмяФО = "ИспользоватьГруппыДоступаПартнеров";
		Если НЕ ПолучитьФункциональнуюОпцию(ИмяФО) Тогда
			МассивИсключаемыхЭлементов.Добавить("ГруппаДоступа");
		КонецЕсли;
		
		ОписаниеФормы.Вставить("МассивИсключаемыхЭлементов", МассивИсключаемыхЭлементов);
		
		СписокНаборовДопРеквизитов = Новый СписокЗначений;
		СписокНаборовДопРеквизитов.Добавить(УправлениеСвойствами.НаборСвойствПоИмени("Справочник_Партнеры_Общие"));
		СписокНаборовДопРеквизитов.Добавить(УправлениеСвойствами.НаборСвойствПоИмени("Справочник_Партнеры_Компании_CRM"));
		СписокНаборовДопРеквизитов.Добавить(УправлениеСвойствами.НаборСвойствПоИмени("Справочник_Партнеры_ЧастныеЛица_CRM"));
		ОписаниеФормы.Вставить("СписокНаборовДопРеквизитов", СписокНаборовДопРеквизитов);
		ОписаниеФормы.Вставить("ИмяЭлементаПередКоторымВставлять", "ГруппаСвязанныеСписки");
		
		ОписанияФорм.Вставить(СтрЗаменить("Справочник.Партнеры.Форма.CRM_Модуль_ФормаЭлементаРеквизитыКонтрагентаНовая",
			 ".", "_"),
			 ОписаниеФормы);
		
	КонецЕсли;		
	
	#КонецОбласти
	
	#Область КонтактныеЛицаФормаЭлементаНовая

	ОписаниеФормы = Новый Структура;

	МассивОбластей = Новый Массив;
	МассивОбластей.Добавить("ГруппаСведения");
	МассивОбластей.Добавить("ГруппаДополнительно");
	ОписаниеФормы.Вставить("МассивОбластей", МассивОбластей);
	
	МассивИсключаемыхЭлементов = Новый Массив;
	МассивИсключаемыхЭлементов.Добавить("Ссылка");
	МассивИсключаемыхЭлементов.Добавить("ДекорацияАвторДата");
	МассивИсключаемыхЭлементов.Добавить("ГруппаДополнительныеРеквизиты");
	
	ОписаниеФормы.Вставить("МассивИсключаемыхЭлементов", МассивИсключаемыхЭлементов);
	
	СписокНаборовДопРеквизитов = Новый СписокЗначений;
	СписокНаборовДопРеквизитов.Добавить(УправлениеСвойствами.НаборСвойствПоИмени("Справочник_КонтактныеЛицаПартнеров"));
	ОписаниеФормы.Вставить("СписокНаборовДопРеквизитов", СписокНаборовДопРеквизитов);
	ОписаниеФормы.Вставить("ИмяЭлементаПередКоторымВставлять", "ГруппаСвязанныеСписки");
	
	ОписанияФорм.Вставить(СтрЗаменить("Справочник.КонтактныеЛицаПартнеров.Форма.CRM_ФормаЭлементаНовая",
		 ".", "_"),
		 ОписаниеФормы);
	
	#КонецОбласти
	
	#Область CRM_ПотенциальныеКлиентыФормаЭлемента

	ОписаниеФормы = Новый Структура;

	МассивОбластей = Новый Массив;
	МассивОбластей.Добавить("ГруппаСведения");
	МассивОбластей.Добавить("ГруппаДополнительно");
	ОписаниеФормы.Вставить("МассивОбластей", МассивОбластей);
	
	МассивИсключаемыхЭлементов = Новый Массив;
	МассивИсключаемыхЭлементов.Добавить("Ссылка");
	МассивИсключаемыхЭлементов.Добавить("ДекорацияАвторДата");
	МассивИсключаемыхЭлементов.Добавить("ГруппаДополнительныеРеквизиты");
	
	ОписаниеФормы.Вставить("МассивИсключаемыхЭлементов", МассивИсключаемыхЭлементов);
	
	СписокНаборовДопРеквизитов = Новый СписокЗначений;
	СписокНаборовДопРеквизитов.Добавить(УправлениеСвойствами.НаборСвойствПоИмени("Справочник_CRM_ПотенциальныеКлиенты"));
	ОписаниеФормы.Вставить("СписокНаборовДопРеквизитов", СписокНаборовДопРеквизитов);
	ОписаниеФормы.Вставить("ИмяЭлементаПередКоторымВставлять", "ГруппаНиз");
	
	ОписанияФорм.Вставить(СтрЗаменить("Справочник.CRM_ПотенциальныеКлиенты.Форма.ФормаЭлемента", ".", "_"), ОписаниеФормы);
	
	#КонецОбласти
	
	Для каждого ОписаниеФормы Из ОписанияФорм Цикл
		ОписаниеФормы.Значение.МассивИсключаемыхЭлементов.Добавить("ДопНастроитьРасположениеЭлементовФормы");
	КонецЦикла;
	
	Возврат ОписанияФорм;
	
КонецФункции

// Размещает элементы по настройке.
//
// Параметры:
//  Форма		  - ФормаКлиентскогоПриложения - в которой будут отображаться дополнительные реквизиты.
//	ОписаниеФормы - Структура - описание формы.
//	ПостфиксФормы - Строка - постфикс формы.
//
Процедура РазместитьЭлементыПоНастройке(Форма, ОписаниеФормы = Неопределено, ПостфиксФормы = "") Экспорт
	
	Если ОписаниеФормы = Неопределено Тогда
		ОписаниеНастраиваемыхФорм().Свойство(СтрЗаменить(Форма.ИмяФормы, ".", "_"), ОписаниеФормы);
	КонецЕсли;

	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	Разделы.ИмяЭлемента КАК ИмяЭлемента,
	|	Разделы.ПорядокРасположения КАК ПорядокРасположения,
	|	Разделы.ЗаголовокЭлемента КАК ЗаголовокЭлемента
	|ИЗ
	|	РегистрСведений.CRM_НастройкиРасположенияЭлементовНаФормах КАК Разделы
	|ГДЕ
	|	Разделы.ИмяФормы = &ИмяФормы
	|	И Разделы.ИмяЭлемента = Разделы.ИмяЭлементаРазмещения
	|
	|УПОРЯДОЧИТЬ ПО
	|	ПорядокРасположения
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Элементы.ИмяЭлемента КАК ИмяЭлемента,
	|	Элементы.ИмяЭлементаРазмещения КАК ИмяЭлементаРазмещения,
	|	Элементы.ПорядокРасположения КАК ПорядокРасположения,
	|	Элементы.ЗаголовокЭлемента КАК ЗаголовокЭлемента,
	|	ТИПЗНАЧЕНИЯ(Элементы.ИмяЭлемента) <> ТИПЗНАЧЕНИЯ("""") КАК ЭтоДополнительныйРеквизит
	|ИЗ
	|	РегистрСведений.CRM_НастройкиРасположенияЭлементовНаФормах КАК Элементы
	|ГДЕ
	|	Элементы.ИмяФормы = &ИмяФормы
	|	И Элементы.ИмяЭлемента <> Элементы.ИмяЭлементаРазмещения
	|
	|УПОРЯДОЧИТЬ ПО
	|	ПорядокРасположения");
	
	Запрос.УстановитьПараметр("ИмяФормы", Форма.ИмяФормы + ?(ПостфиксФормы = "", "", "_") + ПостфиксФормы);
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	// Добавление разделов.
	ВыборкаРазделов = РезультатЗапроса[0].Выбрать();
	Если ВыборкаРазделов.Количество() > ОписаниеФормы.МассивОбластей.Количество() Тогда
		
		ВставлятьРазделыПередИмя = Неопределено;
		ОписаниеФормы.Свойство("ИмяЭлементаПередКоторымВставлять", ВставлятьРазделыПередИмя);
		ВставлятьРазделыПеред = Форма.Элементы.Найти(ВставлятьРазделыПередИмя);
		
		ГруппаРазделов = Форма.Элементы.Найти("ПользовательскиеРазделыДанных");
		Если ГруппаРазделов = Неопределено Тогда
			Если ВставлятьРазделыПеред = Неопределено Тогда
				ГруппаРазделов = Форма.Элементы.Добавить("ПользовательскиеРазделыДанных", Тип("ГруппаФормы"));
			Иначе
				ГруппаРазделов = Форма.Элементы.Вставить("ПользовательскиеРазделыДанных", Тип("ГруппаФормы"),
					 ВставлятьРазделыПеред.Родитель,
					 ВставлятьРазделыПеред);
			КонецЕсли;
			ГруппаРазделов.Вид = ВидГруппыФормы.ОбычнаяГруппа;
			ГруппаРазделов.Отображение = ОтображениеОбычнойГруппы.Нет;
			ГруппаРазделов.ОтображатьЗаголовок = Ложь;
			ГруппаРазделов.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
		КонецЕсли;
		
		Пока ВыборкаРазделов.Следующий() Цикл
			
			ИмяЭлемента = ВыборкаРазделов.ИмяЭлемента;
			ЭлементРазмещения = Форма.Элементы.Найти(ИмяЭлемента);
			
			Если ЭлементРазмещения = Неопределено Тогда
				
				ЭлементРазмещенияКонтейнер = Форма.Элементы.Добавить(
					"Контейнер_" + ИмяЭлемента,
					Тип("ГруппаФормы"),
					ГруппаРазделов);
				ЭлементРазмещенияКонтейнер.Вид = ВидГруппыФормы.ОбычнаяГруппа;
				ЭлементРазмещенияКонтейнер.Отображение = ОтображениеОбычнойГруппы.Нет;
				ЭлементРазмещенияКонтейнер.ОтображатьЗаголовок = Ложь;
				ЭлементРазмещенияКонтейнер.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
				
				ИмяКомандыПереключения = "КомандаПереключить_" + ИмяЭлемента;
				КомандаПереключения = Форма.Команды.Добавить(ИмяКомандыПереключения);
				КомандаПереключения.Заголовок = ВыборкаРазделов.ЗаголовокЭлемента;
				КомандаПереключения.Картинка = БиблиотекаКартинок.СтрелкаВправо;
				КомандаПереключения.Действие = "Подключаемый_ВыполнитьПереопределяемуюКоманду";
				
				КнопкаПереключения = Форма.Элементы.Добавить(
					ИмяКомандыПереключения,
					Тип("КнопкаФормы"),
					ЭлементРазмещенияКонтейнер);
				КнопкаПереключения.Вид = ВидКнопкиФормы.Гиперссылка;
				КнопкаПереключения.ИмяКоманды = ИмяКомандыПереключения;
				КнопкаПереключения.ЦветТекста = ЦветаСтиля.CRM_ОсновнойГолубой;
				
				ЭлементРазмещения = Форма.Элементы.Добавить(
					ИмяЭлемента,
					Тип("ГруппаФормы"),
					ЭлементРазмещенияКонтейнер);
				ЭлементРазмещения.Заголовок = ВыборкаРазделов.ЗаголовокЭлемента;
				ЭлементРазмещения.Вид = ВидГруппыФормы.ОбычнаяГруппа;
				ЭлементРазмещения.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
				//ЭлементРазмещения.ОтображениеУправления = ОтображениеУправленияОбычнойГруппы.Картинка;
				//ЭлементРазмещения.Поведение = ПоведениеОбычнойГруппы.Свертываемая;
				ЭлементРазмещения.Отображение = ОтображениеОбычнойГруппы.Нет;
				ЭлементРазмещения.ОтображатьЗаголовок = Ложь;
				//ЭлементРазмещения.ЦветТекстаЗаголовка = ЦветаСтиля.CRM_ЧерныйЦветТекста;
				//ЭлементРазмещения.Скрыть();
				ЭлементРазмещения.Видимость = Ложь;
				
				Декорация = Форма.Элементы.Добавить(
					"Декорация" + ИмяЭлемента,
					Тип("ДекорацияФормы"),
					ГруппаРазделов);
				Декорация.Вид = ВидДекорацииФормы.Надпись;
				Декорация.Высота = 1;
				Декорация.Шрифт = Новый Шрифт(, 1);
				Декорация.ЦветРамки = Новый Цвет(199, 199, 199);
				Декорация.Рамка = Новый Рамка(ТипРамкиЭлементаУправления.ЧертаСверху, 1);
				Декорация.РастягиватьПоГоризонтали = Истина;
				Декорация.РастягиватьПоВертикали = Ложь;
				Декорация.АвтоМаксимальнаяШирина = Ложь;
				
			Иначе
				ЭлементРазмещения.Заголовок = ВыборкаРазделов.ЗаголовокЭлемента;
				КнопкаПереключения = Форма.Элементы.Найти("КомандаПереключить_" + ИмяЭлемента);
				Если КнопкаПереключения <> Неопределено Тогда
					КнопкаПереключения.Заголовок = ВыборкаРазделов.ЗаголовокЭлемента;
				КонецЕсли;
			КонецЕсли;
			
			Если ОписаниеФормы.МассивОбластей.Найти(ИмяЭлемента) = Неопределено Тогда
				Если ВыборкаРазделов.ПорядокРасположения >= ГруппаРазделов.ПодчиненныеЭлементы.Количество() Тогда
				Иначе
					ПередЭлементом = ГруппаРазделов.ПодчиненныеЭлементы[ВыборкаРазделов.ПорядокРасположения - 1];
					ЭлементРазмещенияКонтейнер = Форма.Элементы.Найти("Контейнер_" + ИмяЭлемента);
					Если ЭлементРазмещенияКонтейнер <> ПередЭлементом Тогда
						Форма.Элементы.Переместить(ЭлементРазмещенияКонтейнер, ГруппаРазделов, ПередЭлементом);
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
			
		КонецЦикла;
	КонецЕсли;
	
	// Размещение полей в разделы.
	ВыборкаЭлементов = РезультатЗапроса[1].Выбрать();
	Пока ВыборкаЭлементов.Следующий() Цикл
		
		ИмяЭлементаРазмещения = ВыборкаЭлементов.ИмяЭлементаРазмещения;
		
		Если ТипЗнч(ВыборкаЭлементов.ИмяЭлемента) = Тип("Строка") Тогда
			Элемент = Форма.Элементы.Найти(ВыборкаЭлементов.ИмяЭлемента);
		Иначе
			Элемент = Неопределено;
			Если Форма.Свойства_ИспользоватьСвойства И Форма.Свойства_ИспользоватьДопРеквизиты Тогда
				ОписаниеДопРеквизитов = Форма.Свойства_ОписаниеДополнительныхРеквизитов.НайтиСтроки(Новый Структура("Свойство",
					 ВыборкаЭлементов.ИмяЭлемента));
				Если ОписаниеДопРеквизитов.Количество() <> 0 Тогда
					Элемент = CRM_УправлениеСвойствами.ЭлементДопРеквизита(Форма, ОписаниеДопРеквизитов[0]);
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
		ЭлементРазмещения = Форма.Элементы.Найти(ИмяЭлементаРазмещения);
		
		Если Элемент <> Неопределено И ЭлементРазмещения <> Неопределено 
			И (ТипЗнч(ВыборкаЭлементов.ИмяЭлемента) <> Тип("Строка") 
			ИЛИ ОписаниеФормы.МассивОбластей.Найти(Элемент.Родитель.Имя) <> Неопределено
			ИЛИ СтрНайти(Элемент.Родитель.Имя, "ПользовательскийРаздел")) = 1 Тогда
			Если ВыборкаЭлементов.ПорядокРасположения >= ЭлементРазмещения.ПодчиненныеЭлементы.Количество() Тогда
				Форма.Элементы.Переместить(Элемент, ЭлементРазмещения);
			Иначе
				ПередЭлементом = ЭлементРазмещения.ПодчиненныеЭлементы[ВыборкаЭлементов.ПорядокРасположения - 1];
				Если Элемент <> ПередЭлементом Тогда
					Форма.Элементы.Переместить(Элемент, ЭлементРазмещения, ПередЭлементом);
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	ВыборкаРазделов.Сбросить();
	Пока ВыборкаРазделов.Следующий() Цикл
		
		СтруктураПоиска = Новый Структура;
		СтруктураПоиска.Вставить("ИмяЭлементаРазмещения", ВыборкаРазделов.ИмяЭлемента);
		СтруктураПоиска.Вставить("ЭтоДополнительныйРеквизит", Истина);
		ВыборкаЭлементов.Сбросить();
		ВывестиРазделПринудительно = ВыборкаЭлементов.НайтиСледующий(СтруктураПоиска);
		
		ЭлементРазмещения = Форма.Элементы.Найти(ВыборкаРазделов.ИмяЭлемента);
		
		Декорация = Форма.Элементы.Найти("Декорация" + ВыборкаРазделов.ИмяЭлемента);
		Если Декорация <> Неопределено Тогда
			Декорация.Видимость = ВывестиРазделПринудительно Или (ЭлементРазмещения.ПодчиненныеЭлементы.Количество() > 0);
		КонецЕсли;
		
		КнопкаПереключения = Форма.Элементы.Найти("КомандаПереключить_" + ВыборкаРазделов.ИмяЭлемента);
		Если КнопкаПереключения <> Неопределено Тогда
			КнопкаПереключения.Видимость = ВывестиРазделПринудительно Или (ЭлементРазмещения.ПодчиненныеЭлементы.Количество() > 0);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Функция ЕстьДополнительныеСвойстваВОбластиОсновное(ИмяФормы, ПостфиксФормы) Экспорт
	
	ЭтоПоддержка = ПостфиксФормы = "_Поддержка";
	
	ОписаниеФормы = Неопределено;
	
	ОписанияФорм = ОписаниеНастраиваемыхФорм(ЭтоПоддержка);
	КлючФормы = СтрЗаменить(ИмяФормы, ".", "_");
	
	Если Не ОписанияФорм.Свойство(КлючФормы, ОписаниеФормы) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	НастройкиРасположения.ИмяЭлемента КАК ИмяЭлемента
	|ИЗ
	|	РегистрСведений.CRM_НастройкиРасположенияЭлементовНаФормах КАК НастройкиРасположения
	|ГДЕ
	|	НастройкиРасположения.ИмяФормы = &ИмяФормы
	|	И НастройкиРасположения.ИмяЭлементаРазмещения = &ИмяОбласти
	|	И ТИПЗНАЧЕНИЯ(НастройкиРасположения.ИмяЭлемента) <> ТИПЗНАЧЕНИЯ("""")");
	
	Запрос.УстановитьПараметр("ИмяОбласти", "ГруппаОсновное");
	Запрос.УстановитьПараметр("ИмяФормы", ИмяФормы + ПостфиксФормы);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат Не РезультатЗапроса.Пустой();
	
КонецФункции

#КонецОбласти
